
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 6 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.appinsights_connection_string
  * azurerm_key_vault_secret.appinsights_key
  * azurerm_key_vault_secret.appinsights_preview_connection_string[0]
  * azurerm_key_vault_secret.appinsights_preview_key[0]
  * azurerm_monitor_metric_alert.metric_alert_exceptions[0]
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_application_insights.appinsights
  * azurerm_application_insights.appinsights_preview[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights must be replaced
-/+ resource "azurerm_application_insights" "appinsights" {
      ~ app_id                                = "1847f1f1-b293-4c17-a956-69970048cc1c" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.Insights/components/sptribs-appinsights-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "westeurope" -> "uksouth" # forces replacement
        name                                  = "sptribs-appinsights-aat"
        tags                                  = {
            "BuiltFrom"           = "https://github.com/HMCTS/sptribs-shared-infrastructure.git"
            "application"         = "special-tribunals"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#special-tribunals-dev-channel"
            "environment"         = "staging"
            "managedBy"           = "Special Tribunals"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_application_insights.appinsights_preview[0] must be replaced
-/+ resource "azurerm_application_insights" "appinsights_preview" {
      ~ app_id                                = "90f16e04-970c-45ee-bc2c-12f2b406eb68" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.Insights/components/sptribs-appinsights-preview" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "westeurope" -> "uksouth" # forces replacement
        name                                  = "sptribs-appinsights-preview"
        tags                                  = {
            "BuiltFrom"           = "https://github.com/HMCTS/sptribs-shared-infrastructure.git"
            "application"         = "special-tribunals"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#special-tribunals-dev-channel"
            "environment"         = "staging"
            "managedBy"           = "Special Tribunals"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.appinsights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights_connection_string" {
        id                      = "https://sptribs-aat.vault.azure.net/secrets/app-insights-connection-string/f07d1fe953a44025b283bfbc3a47bee6"
        name                    = "app-insights-connection-string"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/sptribs-shared-infrastructure.git"
            "application"         = "special-tribunals"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#special-tribunals-dev-channel"
            "environment"         = "staging"
            "managedBy"           = "Special Tribunals"
            "source"              = "App Insights sptribs-appinsights-aat"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.appinsights_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights_key" {
        id                      = "https://sptribs-aat.vault.azure.net/secrets/app-insights-instrumentation-key/d06966db2480433ea701c00a1d49c1ef"
        name                    = "app-insights-instrumentation-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/sptribs-shared-infrastructure.git"
            "application"         = "special-tribunals"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#special-tribunals-dev-channel"
            "environment"         = "staging"
            "managedBy"           = "Special Tribunals"
            "source"              = "App Insights sptribs-appinsights-aat"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.appinsights_preview_connection_string[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights_preview_connection_string" {
        id                      = "https://sptribs-aat.vault.azure.net/secrets/app-insights-connection-string-preview/dfab3c50a01f40719b8bb27134ff67cd"
        name                    = "app-insights-connection-string-preview"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/sptribs-shared-infrastructure.git"
            "application"         = "special-tribunals"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#special-tribunals-dev-channel"
            "environment"         = "staging"
            "managedBy"           = "Special Tribunals"
            "source"              = "App Insights sptribs-appinsights-preview"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.appinsights_preview_key[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights_preview_key" {
        id                      = "https://sptribs-aat.vault.azure.net/secrets/app-insights-instrumentation-key-preview/9b2150456d334cf8a257f41f7e665eea"
        name                    = "app-insights-instrumentation-key-preview"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/sptribs-shared-infrastructure.git"
            "application"         = "special-tribunals"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#special-tribunals-dev-channel"
            "environment"         = "staging"
            "managedBy"           = "Special Tribunals"
            "source"              = "App Insights sptribs-appinsights-preview"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_monitor_metric_alert.metric_alert_exceptions[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "metric_alert_exceptions" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.Insights/metricAlerts/exceptions_alert"
        name                = "exceptions_alert"
      ~ scopes              = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.Insights/components/sptribs-appinsights-aat",
        ] -> (known after apply)
        tags                = {
            "BuiltFrom"           = "https://github.com/HMCTS/sptribs-shared-infrastructure.git"
            "application"         = "special-tribunals"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#special-tribunals-dev-channel"
            "environment"         = "staging"
            "managedBy"           = "Special Tribunals"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat|sptribs-aat"
        name                       = "sptribs-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 6 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":30,"Program":"tfcmt","SHA1":"","Vars":{}} -->